Revit 2024 API
PDFExportOptions.StopOnError Property
 Whether export process should stop when a view fails to export
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public bool StopOnError { get; set; }
Visual Basic
Public Property StopOnError As Boolean
	Get
	Set
Visual C++
public:
property bool StopOnError {
	bool get ();
	void set (bool value);
}
See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace